sdaiIsInstanceOfBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Determines whether a specified application instance belongs to a specified type.
\param instance   [in] An application instance to be checked.
\param entityName [in] A string that contains the name of the entity type.
\returns sdaiTRUE if the application instance belongs to the specified type; otherwise, the function returns false.